src/test/resources/soap/sample-not-secured.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ent="http://wandrell.com/example/ws/entity">
    <soapenv:Header />
    <soapenv:Body>
        <ent:getEntityRequest>
            <ent:id>1</ent:id>
        </ent:getEntityRequest>
    </soapenv:Body>
</soapenv:Envelope>